app/views/artists/index.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

			<li>Artist: <%= link_to "#{painting.artist.first_name} #{painting.artist.last_name}", artist_path(painting.artist) %> | Price: $<%= painting.price %></li>