app/controllers/paintings_controller.rb

	def index
		@paintings = Painting.all
---
SELECT "paintings".* FROM "paintings"