app/controllers/sessions_controller.rb

	def create
		@artist = Artist.find_by(username: params[:username])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."username" = $1 LIMIT $2  [["username", "alexg622"], ["LIMIT", 1]]